luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_bf.h
/** \brief  Offset for Ifx_CAN_MO_EDATA2_Bits.DB2 */
#define IFX_CAN_MO_EDATA2_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA2_Bits.DB3 */
#define IFX_CAN_MO_EDATA2_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA2_Bits.DB3 */
#define IFX_CAN_MO_EDATA2_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA2_Bits.DB3 */
#define IFX_CAN_MO_EDATA2_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA3_Bits.DB0 */
#define IFX_CAN_MO_EDATA3_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA3_Bits.DB0 */
#define IFX_CAN_MO_EDATA3_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA3_Bits.DB0 */
#define IFX_CAN_MO_EDATA3_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA3_Bits.DB1 */
#define IFX_CAN_MO_EDATA3_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA3_Bits.DB1 */
#define IFX_CAN_MO_EDATA3_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA3_Bits.DB1 */
#define IFX_CAN_MO_EDATA3_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA3_Bits.DB2 */
#define IFX_CAN_MO_EDATA3_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA3_Bits.DB2 */
#define IFX_CAN_MO_EDATA3_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA3_Bits.DB2 */
#define IFX_CAN_MO_EDATA3_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA3_Bits.DB3 */
#define IFX_CAN_MO_EDATA3_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA3_Bits.DB3 */
#define IFX_CAN_MO_EDATA3_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA3_Bits.DB3 */
#define IFX_CAN_MO_EDATA3_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA4_Bits.DB0 */
#define IFX_CAN_MO_EDATA4_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA4_Bits.DB0 */
#define IFX_CAN_MO_EDATA4_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA4_Bits.DB0 */
#define IFX_CAN_MO_EDATA4_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA4_Bits.DB1 */
#define IFX_CAN_MO_EDATA4_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA4_Bits.DB1 */
#define IFX_CAN_MO_EDATA4_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA4_Bits.DB1 */
#define IFX_CAN_MO_EDATA4_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA4_Bits.DB2 */
#define IFX_CAN_MO_EDATA4_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA4_Bits.DB2 */
#define IFX_CAN_MO_EDATA4_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA4_Bits.DB2 */
#define IFX_CAN_MO_EDATA4_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA4_Bits.DB3 */
#define IFX_CAN_MO_EDATA4_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA4_Bits.DB3 */
#define IFX_CAN_MO_EDATA4_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA4_Bits.DB3 */
#define IFX_CAN_MO_EDATA4_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA5_Bits.DB0 */
#define IFX_CAN_MO_EDATA5_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA5_Bits.DB0 */
#define IFX_CAN_MO_EDATA5_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA5_Bits.DB0 */
#define IFX_CAN_MO_EDATA5_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA5_Bits.DB1 */
#define IFX_CAN_MO_EDATA5_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA5_Bits.DB1 */
#define IFX_CAN_MO_EDATA5_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA5_Bits.DB1 */
#define IFX_CAN_MO_EDATA5_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA5_Bits.DB2 */
#define IFX_CAN_MO_EDATA5_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA5_Bits.DB2 */
#define IFX_CAN_MO_EDATA5_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA5_Bits.DB2 */
#define IFX_CAN_MO_EDATA5_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA5_Bits.DB3 */
#define IFX_CAN_MO_EDATA5_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA5_Bits.DB3 */
#define IFX_CAN_MO_EDATA5_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA5_Bits.DB3 */
#define IFX_CAN_MO_EDATA5_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_EDATA6_Bits.DB0 */
#define IFX_CAN_MO_EDATA6_DB0_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA6_Bits.DB0 */
#define IFX_CAN_MO_EDATA6_DB0_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA6_Bits.DB0 */
#define IFX_CAN_MO_EDATA6_DB0_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_EDATA6_Bits.DB1 */
#define IFX_CAN_MO_EDATA6_DB1_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA6_Bits.DB1 */
#define IFX_CAN_MO_EDATA6_DB1_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA6_Bits.DB1 */
#define IFX_CAN_MO_EDATA6_DB1_OFF (8u)

/** \brief  Length for Ifx_CAN_MO_EDATA6_Bits.DB2 */
#define IFX_CAN_MO_EDATA6_DB2_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA6_Bits.DB2 */
#define IFX_CAN_MO_EDATA6_DB2_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA6_Bits.DB2 */
#define IFX_CAN_MO_EDATA6_DB2_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_EDATA6_Bits.DB3 */
#define IFX_CAN_MO_EDATA6_DB3_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_EDATA6_Bits.DB3 */
#define IFX_CAN_MO_EDATA6_DB3_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_EDATA6_Bits.DB3 */
#define IFX_CAN_MO_EDATA6_DB3_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_FCR_Bits.BRS */
#define IFX_CAN_MO_FCR_BRS_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_FCR_Bits.BRS */
#define IFX_CAN_MO_FCR_BRS_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_FCR_Bits.BRS */
#define IFX_CAN_MO_FCR_BRS_OFF (5u)

/** \brief  Length for Ifx_CAN_MO_FCR_Bits.DATC */
#define IFX_CAN_MO_FCR_DATC_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_FCR_Bits.DATC */
#define IFX_CAN_MO_FCR_DATC_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_FCR_Bits.DATC */
#define IFX_CAN_MO_FCR_DATC_OFF (11u)

/** \brief  Length for Ifx_CAN_MO_FCR_Bits.DLC */
#define IFX_CAN_MO_FCR_DLC_LEN (4u)

/** \brief  Mask for Ifx_CAN_MO_FCR_Bits.DLC */
#define IFX_CAN_MO_FCR_DLC_MSK (0xfu)

/** \brief  Offset for Ifx_CAN_MO_FCR_Bits.DLC */
#define IFX_CAN_MO_FCR_DLC_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_FCR_Bits.DLCC */
#define IFX_CAN_MO_FCR_DLCC_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_FCR_Bits.DLCC */
#define IFX_CAN_MO_FCR_DLCC_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_FCR_Bits.DLCC */
#define IFX_CAN_MO_FCR_DLCC_OFF (10u)

/** \brief  Length for Ifx_CAN_MO_FCR_Bits.FDF */
#define IFX_CAN_MO_FCR_FDF_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_FCR_Bits.FDF */
#define IFX_CAN_MO_FCR_FDF_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_FCR_Bits.FDF */
#define IFX_CAN_MO_FCR_FDF_OFF (6u)

