luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxCan_bf.h
/** \brief  Length for Ifx_CAN_MO_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_STAT_NEWDAT_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_STAT_NEWDAT_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_STAT_NEWDAT_OFF (3u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.PNEXT */
#define IFX_CAN_MO_STAT_PNEXT_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.PNEXT */
#define IFX_CAN_MO_STAT_PNEXT_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.PNEXT */
#define IFX_CAN_MO_STAT_PNEXT_OFF (24u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.PPREV */
#define IFX_CAN_MO_STAT_PPREV_LEN (8u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.PPREV */
#define IFX_CAN_MO_STAT_PPREV_MSK (0xffu)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.PPREV */
#define IFX_CAN_MO_STAT_PPREV_OFF (16u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.RTSEL */
#define IFX_CAN_MO_STAT_RTSEL_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.RTSEL */
#define IFX_CAN_MO_STAT_RTSEL_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.RTSEL */
#define IFX_CAN_MO_STAT_RTSEL_OFF (6u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.RXEN */
#define IFX_CAN_MO_STAT_RXEN_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.RXEN */
#define IFX_CAN_MO_STAT_RXEN_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.RXEN */
#define IFX_CAN_MO_STAT_RXEN_OFF (7u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.RXPND */
#define IFX_CAN_MO_STAT_RXPND_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.RXPND */
#define IFX_CAN_MO_STAT_RXPND_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.RXPND */
#define IFX_CAN_MO_STAT_RXPND_OFF (0u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.RXUPD */
#define IFX_CAN_MO_STAT_RXUPD_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.RXUPD */
#define IFX_CAN_MO_STAT_RXUPD_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.RXUPD */
#define IFX_CAN_MO_STAT_RXUPD_OFF (2u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_STAT_TXEN0_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_STAT_TXEN0_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_STAT_TXEN0_OFF (9u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_STAT_TXEN1_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_STAT_TXEN1_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_STAT_TXEN1_OFF (10u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.TXPND */
#define IFX_CAN_MO_STAT_TXPND_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.TXPND */
#define IFX_CAN_MO_STAT_TXPND_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.TXPND */
#define IFX_CAN_MO_STAT_TXPND_OFF (1u)

/** \brief  Length for Ifx_CAN_MO_STAT_Bits.TXRQ */
#define IFX_CAN_MO_STAT_TXRQ_LEN (1u)

/** \brief  Mask for Ifx_CAN_MO_STAT_Bits.TXRQ */
#define IFX_CAN_MO_STAT_TXRQ_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_MO_STAT_Bits.TXRQ */
#define IFX_CAN_MO_STAT_TXRQ_OFF (8u)

/** \brief  Length for Ifx_CAN_MSID_Bits.INDEX */
#define IFX_CAN_MSID_INDEX_LEN (6u)

/** \brief  Mask for Ifx_CAN_MSID_Bits.INDEX */
#define IFX_CAN_MSID_INDEX_MSK (0x3fu)

/** \brief  Offset for Ifx_CAN_MSID_Bits.INDEX */
#define IFX_CAN_MSID_INDEX_OFF (0u)

/** \brief  Length for Ifx_CAN_MSIMASK_Bits.IM */
#define IFX_CAN_MSIMASK_IM_LEN (32u)

/** \brief  Mask for Ifx_CAN_MSIMASK_Bits.IM */
#define IFX_CAN_MSIMASK_IM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_CAN_MSIMASK_Bits.IM */
#define IFX_CAN_MSIMASK_IM_OFF (0u)

/** \brief  Length for Ifx_CAN_MSPND_Bits.PND */
#define IFX_CAN_MSPND_PND_LEN (32u)

/** \brief  Mask for Ifx_CAN_MSPND_Bits.PND */
#define IFX_CAN_MSPND_PND_MSK (0xffffffffu)

/** \brief  Offset for Ifx_CAN_MSPND_Bits.PND */
#define IFX_CAN_MSPND_PND_OFF (0u)

/** \brief  Length for Ifx_CAN_N_BTEVR_Bits.BRP */
#define IFX_CAN_N_BTEVR_BRP_LEN (6u)

/** \brief  Mask for Ifx_CAN_N_BTEVR_Bits.BRP */
#define IFX_CAN_N_BTEVR_BRP_MSK (0x3fu)

/** \brief  Offset for Ifx_CAN_N_BTEVR_Bits.BRP */
#define IFX_CAN_N_BTEVR_BRP_OFF (0u)

/** \brief  Length for Ifx_CAN_N_BTEVR_Bits.DIV8 */
#define IFX_CAN_N_BTEVR_DIV8_LEN (1u)

/** \brief  Mask for Ifx_CAN_N_BTEVR_Bits.DIV8 */
#define IFX_CAN_N_BTEVR_DIV8_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_N_BTEVR_Bits.DIV8 */
#define IFX_CAN_N_BTEVR_DIV8_OFF (15u)

/** \brief  Length for Ifx_CAN_N_BTEVR_Bits.SJW */
#define IFX_CAN_N_BTEVR_SJW_LEN (4u)

/** \brief  Mask for Ifx_CAN_N_BTEVR_Bits.SJW */
#define IFX_CAN_N_BTEVR_SJW_MSK (0xfu)

/** \brief  Offset for Ifx_CAN_N_BTEVR_Bits.SJW */
#define IFX_CAN_N_BTEVR_SJW_OFF (8u)

/** \brief  Length for Ifx_CAN_N_BTEVR_Bits.TSEG1 */
#define IFX_CAN_N_BTEVR_TSEG1_LEN (6u)

/** \brief  Mask for Ifx_CAN_N_BTEVR_Bits.TSEG1 */
#define IFX_CAN_N_BTEVR_TSEG1_MSK (0x3fu)

/** \brief  Offset for Ifx_CAN_N_BTEVR_Bits.TSEG1 */
#define IFX_CAN_N_BTEVR_TSEG1_OFF (22u)

/** \brief  Length for Ifx_CAN_N_BTEVR_Bits.TSEG2 */
#define IFX_CAN_N_BTEVR_TSEG2_LEN (5u)

/** \brief  Mask for Ifx_CAN_N_BTEVR_Bits.TSEG2 */
#define IFX_CAN_N_BTEVR_TSEG2_MSK (0x1fu)

/** \brief  Offset for Ifx_CAN_N_BTEVR_Bits.TSEG2 */
#define IFX_CAN_N_BTEVR_TSEG2_OFF (16u)

/** \brief  Length for Ifx_CAN_N_BTR_Bits.BRP */
#define IFX_CAN_N_BTR_BRP_LEN (6u)

/** \brief  Mask for Ifx_CAN_N_BTR_Bits.BRP */
#define IFX_CAN_N_BTR_BRP_MSK (0x3fu)

/** \brief  Offset for Ifx_CAN_N_BTR_Bits.BRP */
#define IFX_CAN_N_BTR_BRP_OFF (0u)

/** \brief  Length for Ifx_CAN_N_BTR_Bits.DIV8 */
#define IFX_CAN_N_BTR_DIV8_LEN (1u)

/** \brief  Mask for Ifx_CAN_N_BTR_Bits.DIV8 */
#define IFX_CAN_N_BTR_DIV8_MSK (0x1u)

/** \brief  Offset for Ifx_CAN_N_BTR_Bits.DIV8 */
#define IFX_CAN_N_BTR_DIV8_OFF (15u)

/** \brief  Length for Ifx_CAN_N_BTR_Bits.SJW */
#define IFX_CAN_N_BTR_SJW_LEN (2u)

/** \brief  Mask for Ifx_CAN_N_BTR_Bits.SJW */
#define IFX_CAN_N_BTR_SJW_MSK (0x3u)

/** \brief  Offset for Ifx_CAN_N_BTR_Bits.SJW */
#define IFX_CAN_N_BTR_SJW_OFF (6u)

/** \brief  Length for Ifx_CAN_N_BTR_Bits.TSEG1 */
#define IFX_CAN_N_BTR_TSEG1_LEN (4u)

/** \brief  Mask for Ifx_CAN_N_BTR_Bits.TSEG1 */
#define IFX_CAN_N_BTR_TSEG1_MSK (0xfu)

